# GetLoops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..GetLoops Method
AreaLoad Class See Also
---
Returns curve loops that define geometry of the area load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<CurveLoop> GetLoops()
```

Visual Basic
---
```text
Public Function GetLoops As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetLoops()
```

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace